In [25]:
import pandas as pd
import numpy as np
import sys

#data_path, schema_path = 'data/news.csv', 'data/news_schema.csv'
#df, schema_df = pd.read_csv(data_path, encoding = "ISO-8859-1"), pd.read_csv(schema_path)

people = {
    "first": ["Dave", "Jane", "John", "Alfred"],
    "last": ["Zimmer", "Doe", "Doe", "Wayne"],
    "email": ["DaveZimmer@mail.com", "JaneDoe@mail.com", "JohnDoe@mail.com", "Alfie@butlers.com"]}
df = pd.DataFrame(people)

In [28]:
df.head()

                 email   first    last
0  DaveZimmer@mail.com    Dave  Zimmer
1     JaneDoe@mail.com    Jane     Doe
2     JohnDoe@mail.com    John     Doe
3    Alfie@butlers.com  Alfred   Wayne

In [29]:
df['first'] + ' ' + df['last']

0     Dave Zimmer
1        Jane Doe
2        John Doe
3    Alfred Wayne
dtype: object

In [30]:
df['full_name'] = df['first'] + ' ' + df['last']

In [31]:
df

                 email   first    last     full_name
0  DaveZimmer@mail.com    Dave  Zimmer   Dave Zimmer
1     JaneDoe@mail.com    Jane     Doe      Jane Doe
2     JohnDoe@mail.com    John     Doe      John Doe
3    Alfie@butlers.com  Alfred   Wayne  Alfred Wayne

In [34]:
df.drop(columns=['first','last'], inplace=False)

                 email     full_name
0  DaveZimmer@mail.com   Dave Zimmer
1     JaneDoe@mail.com      Jane Doe
2     JohnDoe@mail.com      John Doe
3    Alfie@butlers.com  Alfred Wayne

In [35]:
df['full_name'].str.split(" ")

0     [Dave, Zimmer]
1        [Jane, Doe]
2        [John, Doe]
3    [Alfred, Wayne]
Name: full_name, dtype: object

In [36]:
df['full_name'].str.split(" ", expand=True)

        0       1
0    Dave  Zimmer
1    Jane     Doe
2    John     Doe
3  Alfred   Wayne

In [37]:
df[['first', 'last']] = df['full_name'].str.split(" ", expand=True)

In [38]:
df

                 email   first    last     full_name
0  DaveZimmer@mail.com    Dave  Zimmer   Dave Zimmer
1     JaneDoe@mail.com    Jane     Doe      Jane Doe
2     JohnDoe@mail.com    John     Doe      John Doe
3    Alfie@butlers.com  Alfred   Wayne  Alfred Wayne

In [40]:
df.append({'first': 'Tony'}, ignore_index=True)

                 email   first    last     full_name
0  DaveZimmer@mail.com    Dave  Zimmer   Dave Zimmer
1     JaneDoe@mail.com    Jane     Doe      Jane Doe
2     JohnDoe@mail.com    John     Doe      John Doe
3    Alfie@butlers.com  Alfred   Wayne  Alfred Wayne
4                  NaN    Tony     NaN           NaN

In [43]:
people = {
    "first": ["Tony", "Professor"],
    "last": ["Stark", "Ex"],
    "email": ["boss@avengers.com", "boss@x-men.com"]}
df2 = pd.DataFrame(people)
df2.head()

               email      first   last
0  boss@avengers.com       Tony  Stark
1     boss@x-men.com  Professor     Ex

In [45]:
df.append(df2, ignore_index=True)

                 email      first     full_name    last
0  DaveZimmer@mail.com       Dave   Dave Zimmer  Zimmer
1     JaneDoe@mail.com       Jane      Jane Doe     Doe
2     JohnDoe@mail.com       John      John Doe     Doe
3    Alfie@butlers.com     Alfred  Alfred Wayne   Wayne
4    boss@avengers.com       Tony           NaN   Stark
5       boss@x-men.com  Professor           NaN      Ex

In [46]:
df = df.append(df2, ignore_index=True)

In [47]:
df

                 email      first     full_name    last
0  DaveZimmer@mail.com       Dave   Dave Zimmer  Zimmer
1     JaneDoe@mail.com       Jane      Jane Doe     Doe
2     JohnDoe@mail.com       John      John Doe     Doe
3    Alfie@butlers.com     Alfred  Alfred Wayne   Wayne
4    boss@avengers.com       Tony           NaN   Stark
5       boss@x-men.com  Professor           NaN      Ex

In [48]:
df.drop(index=5)

                 email   first     full_name    last
0  DaveZimmer@mail.com    Dave   Dave Zimmer  Zimmer
1     JaneDoe@mail.com    Jane      Jane Doe     Doe
2     JohnDoe@mail.com    John      John Doe     Doe
3    Alfie@butlers.com  Alfred  Alfred Wayne   Wayne
4    boss@avengers.com    Tony           NaN   Stark

In [50]:
df.drop(index=df[df['last'] == 'Doe'].index) # This is basically a conditional

                 email      first     full_name    last
0  DaveZimmer@mail.com       Dave   Dave Zimmer  Zimmer
3    Alfie@butlers.com     Alfred  Alfred Wayne   Wayne
4    boss@avengers.com       Tony           NaN   Stark
5       boss@x-men.com  Professor           NaN      Ex

In [53]:
filt = df['last'] == 'Doe'

In [54]:
df.drop(index=df[filt].index)

                 email      first     full_name    last
0  DaveZimmer@mail.com       Dave   Dave Zimmer  Zimmer
3    Alfie@butlers.com     Alfred  Alfred Wayne   Wayne
4    boss@avengers.com       Tony           NaN   Stark
5       boss@x-men.com  Professor           NaN      Ex

In [64]:
df['full_name'] = df['full_name'].fillna('null')

0    False
1    False
2    False
3    False
4     True
5     True
Name: full_name, dtype: bool

In [63]:
df

                 email      first     full_name    last
0  DaveZimmer@mail.com       Dave   Dave Zimmer  Zimmer
1     JaneDoe@mail.com       Jane      Jane Doe     Doe
2     JohnDoe@mail.com       John      John Doe     Doe
3    Alfie@butlers.com     Alfred  Alfred Wayne   Wayne
4    boss@avengers.com       Tony          null   Stark
5       boss@x-men.com  Professor          null      Ex

In [66]:
df['email'].str.replace('@', '@@')

0    DaveZimmer@@mail.com
1       JaneDoe@@mail.com
2       JohnDoe@@mail.com
3      Alfie@@butlers.com
4      boss@@avengers.com
5         boss@@x-men.com
Name: email, dtype: object